{"char2idx": {"\n": 0, " ": 1, "!": 2, "\"": 3, "$": 4, "&": 5, "'": 6, "(": 7, ")": 8, "*": 9, "+": 10, ",": 11, "-": 12, ".": 13, "/": 14, "0": 15, "1": 16, "2": 17, "3": 18, "4": 19, "5": 20, "6": 21, "7": 22, "8": 23, "9": 24, ":": 25, ";": 26, "<": 27, "=": 28, ">": 29, "?": 30, "A": 31, "B": 32, "C": 33, "D": 34, "E": 35, "F": 36, "G": 37, "H": 38, "I": 39, "J": 40, "K": 41, "L": 42, "M": 43, "N": 44, "O": 45, "P": 46, "Q": 47, "R": 48, "S": 49, "T": 50, "U": 51, "V": 52, "W": 53, "X": 54, "Y": 55, "Z": 56, "[": 57, "]": 58, "_": 59, "a": 60, "b": 61, "c": 62, "d": 63, "e": 64, "f": 65, "g": 66, "h": 67, "i": 68, "j": 69, "k": 70, "l": 71, "m": 72, "n": 73, "o": 74, "p": 75, "q": 76, "r": 77, "s": 78, "t": 79, "u": 80, "v": 81, "w": 82, "x": 83, "y": 84, "z": 85, "{": 86, "}": 87, "~": 88, "\u00b0": 89, "\u00b6": 90, "\u00c4": 91, "\u00c6": 92, "\u00c9": 93, "\u00cb": 94, "\u00d6": 95, "\u00dc": 96, "\u00df": 97, "\u00e2": 98, "\u00e4": 99, "\u00e6": 100, "\u00e7": 101, "\u00e8": 102, "\u00e9": 103, "\u00ea": 104, "\u00eb": 105, "\u00ed": 106, "\u00ef": 107, "\u00f3": 108, "\u00f4": 109, "\u00f5": 110, "\u00f6": 111, "\u00f9": 112, "\u00fc": 113, "\u0152": 114, "\u0153": 115, "\u0391": 116, "\u0396": 117, "\u0398": 118, "\u03a0": 119, "\u03ac": 120, "\u03ad": 121, "\u03ae": 122, "\u03af": 123, "\u03b0": 124, "\u03b1": 125, "\u03b2": 126, "\u03b3": 127, "\u03b4": 128, "\u03b5": 129, "\u03b6": 130, "\u03b7": 131, "\u03b8": 132, "\u03b9": 133, "\u03ba": 134, "\u03bb": 135, "\u03bc": 136, "\u03bd": 137, "\u03be": 138, "\u03bf": 139, "\u03c0": 140, "\u03c1": 141, "\u03c2": 142, "\u03c3": 143, "\u03c4": 144, "\u03c5": 145, "\u03c6": 146, "\u03c7": 147, "\u03c8": 148, "\u03c9": 149, "\u03ca": 150, "\u03cc": 151, "\u03cd": 152, "\u03ce": 153, "\u1f00": 154, "\u1f01": 155, "\u1f04": 156, "\u1f06": 157, "\u1f08": 158, "\u1f10": 159, "\u1f11": 160, "\u1f14": 161, "\u1f15": 162, "\u1f18": 163, "\u1f1c": 164, "\u1f20": 165, "\u1f21": 166, "\u1f24": 167, "\u1f26": 168, "\u1f28": 169, "\u1f29": 170, "\u1f30": 171, "\u1f31": 172, "\u1f34": 173, "\u1f37": 174, "\u1f38": 175, "\u1f39": 176, "\u1f40": 177, "\u1f41": 178, "\u1f44": 179, "\u1f45": 180, "\u1f50": 181, "\u1f51": 182, "\u1f54": 183, "\u1f55": 184, "\u1f5d": 185, "\u1f60": 186, "\u1f61": 187, "\u1f64": 188, "\u1f65": 189, "\u1f66": 190, "\u1f70": 191, "\u1f72": 192, "\u1f74": 193, "\u1f76": 194, "\u1f78": 195, "\u1f7a": 196, "\u1f7c": 197, "\u1f81": 198, "\u1fb6": 199, "\u1fc3": 200, "\u1fc6": 201, "\u1fc7": 202, "\u1fd6": 203, "\u1fe4": 204, "\u1fe5": 205, "\u1fe6": 206, "\u1fec": 207, "\u1ff3": 208, "\u1ff4": 209, "\u1ff6": 210, "\u1ff7": 211, "\u2014": 212, "\u2018": 213, "\u2019": 214, "\u201c": 215, "\u201d": 216, "\u2020": 217, "\u2021": 218, "\u2032": 219, "\u2033": 220}, "idx2char": {"0": "\n", "1": " ", "2": "!", "3": "\"", "4": "$", "5": "&", "6": "'", "7": "(", "8": ")", "9": "*", "10": "+", "11": ",", "12": "-", "13": ".", "14": "/", "15": "0", "16": "1", "17": "2", "18": "3", "19": "4", "20": "5", "21": "6", "22": "7", "23": "8", "24": "9", "25": ":", "26": ";", "27": "<", "28": "=", "29": ">", "30": "?", "31": "A", "32": "B", "33": "C", "34": "D", "35": "E", "36": "F", "37": "G", "38": "H", "39": "I", "40": "J", "41": "K", "42": "L", "43": "M", "44": "N", "45": "O", "46": "P", "47": "Q", "48": "R", "49": "S", "50": "T", "51": "U", "52": "V", "53": "W", "54": "X", "55": "Y", "56": "Z", "57": "[", "58": "]", "59": "_", "60": "a", "61": "b", "62": "c", "63": "d", "64": "e", "65": "f", "66": "g", "67": "h", "68": "i", "69": "j", "70": "k", "71": "l", "72": "m", "73": "n", "74": "o", "75": "p", "76": "q", "77": "r", "78": "s", "79": "t", "80": "u", "81": "v", "82": "w", "83": "x", "84": "y", "85": "z", "86": "{", "87": "}", "88": "~", "89": "\u00b0", "90": "\u00b6", "91": "\u00c4", "92": "\u00c6", "93": "\u00c9", "94": "\u00cb", "95": "\u00d6", "96": "\u00dc", "97": "\u00df", "98": "\u00e2", "99": "\u00e4", "100": "\u00e6", "101": "\u00e7", "102": "\u00e8", "103": "\u00e9", "104": "\u00ea", "105": "\u00eb", "106": "\u00ed", "107": "\u00ef", "108": "\u00f3", "109": "\u00f4", "110": "\u00f5", "111": "\u00f6", "112": "\u00f9", "113": "\u00fc", "114": "\u0152", "115": "\u0153", "116": "\u0391", "117": "\u0396", "118": "\u0398", "119": "\u03a0", "120": "\u03ac", "121": "\u03ad", "122": "\u03ae", "123": "\u03af", "124": "\u03b0", "125": "\u03b1", "126": "\u03b2", "127": "\u03b3", "128": "\u03b4", "129": "\u03b5", "130": "\u03b6", "131": "\u03b7", "132": "\u03b8", "133": "\u03b9", "134": "\u03ba", "135": "\u03bb", "136": "\u03bc", "137": "\u03bd", "138": "\u03be", "139": "\u03bf", "140": "\u03c0", "141": "\u03c1", "142": "\u03c2", "143": "\u03c3", "144": "\u03c4", "145": "\u03c5", "146": "\u03c6", "147": "\u03c7", "148": "\u03c8", "149": "\u03c9", "150": "\u03ca", "151": "\u03cc", "152": "\u03cd", "153": "\u03ce", "154": "\u1f00", "155": "\u1f01", "156": "\u1f04", "157": "\u1f06", "158": "\u1f08", "159": "\u1f10", "160": "\u1f11", "161": "\u1f14", "162": "\u1f15", "163": "\u1f18", "164": "\u1f1c", "165": "\u1f20", "166": "\u1f21", "167": "\u1f24", "168": "\u1f26", "169": "\u1f28", "170": "\u1f29", "171": "\u1f30", "172": "\u1f31", "173": "\u1f34", "174": "\u1f37", "175": "\u1f38", "176": "\u1f39", "177": "\u1f40", "178": "\u1f41", "179": "\u1f44", "180": "\u1f45", "181": "\u1f50", "182": "\u1f51", "183": "\u1f54", "184": "\u1f55", "185": "\u1f5d", "186": "\u1f60", "187": "\u1f61", "188": "\u1f64", "189": "\u1f65", "190": "\u1f66", "191": "\u1f70", "192": "\u1f72", "193": "\u1f74", "194": "\u1f76", "195": "\u1f78", "196": "\u1f7a", "197": "\u1f7c", "198": "\u1f81", "199": "\u1fb6", "200": "\u1fc3", "201": "\u1fc6", "202": "\u1fc7", "203": "\u1fd6", "204": "\u1fe4", "205": "\u1fe5", "206": "\u1fe6", "207": "\u1fec", "208": "\u1ff3", "209": "\u1ff4", "210": "\u1ff6", "211": "\u1ff7", "212": "\u2014", "213": "\u2018", "214": "\u2019", "215": "\u201c", "216": "\u201d", "217": "\u2020", "218": "\u2021", "219": "\u2032", "220": "\u2033"}}